// m * n 그리드 각 칸에 3가지 색을 넣을수 있는 경우의 수, 인접한 두 셀의 색상은 달라야함

const m = 1, n = 2
// Output: 6
// Explanation: The six possible colorings are shown in the image above.

// m = 2 n = 1 => 6, m = 2 n = 2 => 18, m = 3 n =2 => 72, m = 4 n = 2 => 284, m = 5 n = 2 => 1176
// m = 5 n = 3 => 492 * 18, m = 5 n = 5 => 492 * 18^3
// 1 2 3, 1 2 1, 1 3 2, 1 3 1 * 3 = 12
// 1 2,      1 2, 1 3, 1 3      * 3 = 18
// 2 1 or 3, 3 1, 2 1, 3 1 or 2
// m = 1 n = 2 => 12, m = 2 n = 2 => 18   6 => 24 => 96 => 384 =>
// m = 3 n = 1 => 24, m = 3 n = 2 => 72   3 => 18 => 18 * 24 => 18 * 24 * 96 =>
// 그리드 너비가 1이면 3, 2이면 6
// 1 2 3 1, 1 2 1 3, 1 2 1 2, 1 2 3 2, 1 3 2 1, 1 3 1 2, 1 3 1 3, 1 3 2 3 * 3 = 24
// m = 1 n = 3 => 12, m = 1 n = 4 => 24, m = 1 n = 5 => 48
// m = 2 n = 5 => 1152, m = 3 n = 5 => 27648
// n 늘면 * 2 m 늘면 * 3
// m = 2 n = 3 => 36, m = 5 n = 5 => 48 * 48 * 48
// 3  6  12  24  48
// 6  18 54
// 12 54 246
// 24 156
// 48
// TODO: 벽
var colorTheGrid = function (m, n) {

};

const a = 18 * 72 * 72 * 288
console.log(a)